DCL ERROR_TEXT CHAR(50);
DCL CUSTOMER_NO FIXED DECIMAL(8);

CUSTOMER_PROCESS: PROCEDURE(PROCESS_TEXT);
    DCL PROCESS_TEXT CHAR(50);

    ERROR_TEXT = PROCESS_TEXT;
    CALL WRITE_ERROR(ERROR_TEXT);
END CUSTOMER_PROCESS;

CALL CUSTOMER_PROCESS('CUSTOMER NOT FOUND');