DCL MUST_NO FIXED DECIMAL(8);
DCL CUSTOMER_NO FIXED DECIMAL(8);
DCL CUSTOMER_NAME CHAR(30);

CUSTOMER_PROCESS: PROCEDURE;
    CUSTOMER_NO = MUST_NO;
    CALL FETCH_CUSTOMER(CUSTOMER_NO, CUSTOMER_NAME);
END CUSTOMER_PROCESS;